In [134]:
import pandas as pd
import numpy as np

In [135]:
#to create series np.nan is a null value
s=pd.Series([1,2,3,4,5,6,np.nan,8,9,10])
s

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     NaN
7     8.0
8     9.0
9    10.0
dtype: float64

In [136]:
# to create a data from by passing a numpy array with datetime index and label columns
d=pd.date_range("20220531",periods=10)
d

DatetimeIndex(['2022-05-31', '2022-06-01', '2022-06-02', '2022-06-03',
               '2022-06-04', '2022-06-05', '2022-06-06', '2022-06-07',
               '2022-06-08', '2022-06-09'],
              dtype='datetime64[ns]', freq='D')

In [137]:
#to create a data frame
#the np.random.randn() function creates an array of specified shape and fills it with random values as per standard normal distribution
#column name with labels A,B,C,D
#index of data frame is the d and it containsdatetime index
df=pd.DataFrame(np.random.randn(10,4),index=d,columns=["A","B","C","D"])
df

                   A         B         C         D
2022-05-31  0.057767 -0.237072  1.074943 -0.432027
2022-06-01  0.943025 -2.029155 -0.506864  0.173730
2022-06-02 -0.320725  0.971934  1.478628  0.177039
2022-06-03 -0.189743  2.404819  2.132989 -0.227262
2022-06-04 -0.292651  0.321200  0.734138  0.355978
2022-06-05  0.249379  0.967810 -1.965286  0.328711
2022-06-06  2.563224 -0.341943  0.708257  0.061063
2022-06-07 -2.662937 -0.809709  1.198452  0.268367
2022-06-08  0.107300 -0.026809  0.475158 -1.622722
2022-06-09  1.187577 -2.301539  0.636699 -2.091514

In [138]:
#create a dataframe by passing a dictionary of objects and it converted into a series 
df1=pd.DataFrame({"A":[1,2,3,4],
                 "B":pd.Timestamp("20220531"),
                 "C":pd.Series(1,index=list(range(4)),dtype="float32"),
                 "D":np.array([5]*4,dtype="int32"),
                 "E":pd.Categorical(["true","false","true","false"]),
                 "F":"pandas"})
df1

   A          B    C  D      E       F
0  1 2022-05-31  1.0  5   true  pandas
1  2 2022-05-31  1.0  5  false  pandas
2  3 2022-05-31  1.0  5   true  pandas
3  4 2022-05-31  1.0  5  false  pandas

In [139]:
#to check datatypes
df1.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [140]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [141]:
#view the data ,it will give 5 values
df.head()

                   A         B         C         D
2022-05-31  0.057767 -0.237072  1.074943 -0.432027
2022-06-01  0.943025 -2.029155 -0.506864  0.173730
2022-06-02 -0.320725  0.971934  1.478628  0.177039
2022-06-03 -0.189743  2.404819  2.132989 -0.227262
2022-06-04 -0.292651  0.321200  0.734138  0.355978

In [142]:
# to get the last 5 values
import pandas as pd
import numpy as np
d=pd.date_range("20220531",periods=10)
df=pd.DataFrame(np.random.randn(10,4),index=d,columns=["A","B","C","D"])
df.tail()

                   A         B         C         D
2022-06-05  0.266158 -1.397164  0.460312  0.353587
2022-06-06  1.230046 -0.183181 -0.819522  1.119959
2022-06-07 -1.226685 -0.975312  0.887330 -1.237379
2022-06-08 -1.071320 -0.066131  1.046769 -1.118565
2022-06-09  0.266229 -0.479117 -0.306122  1.828267

In [143]:
#to get index of dataframe
df.index

DatetimeIndex(['2022-05-31', '2022-06-01', '2022-06-02', '2022-06-03',
               '2022-06-04', '2022-06-05', '2022-06-06', '2022-06-07',
               '2022-06-08', '2022-06-09'],
              dtype='datetime64[ns]', freq='D')

In [144]:
#to get the column of the dataframe
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [145]:
#to give the numpy representation of the data
df.to_numpy()

array([[-0.92888064,  0.61004834,  0.10358616, -0.2862184 ],
       [ 0.40509875,  1.1353288 , -1.71655691, -0.1543454 ],
       [ 0.5401402 ,  2.20861467, -0.83845421,  1.73216082],
       [-1.10542158, -0.2250297 , -0.56470131, -0.71030006],
       [-0.24194692,  0.03821016, -1.58313873,  0.58924764],
       [ 0.26615834, -1.39716361,  0.46031225,  0.35358721],
       [ 1.23004614, -0.18318065, -0.81952184,  1.11995851],
       [-1.22668487, -0.97531157,  0.88732957, -1.23737883],
       [-1.07131997, -0.06613072,  1.04676912, -1.11856501],
       [ 0.2662287 , -0.47911697, -0.30612245,  1.82826701]])

In [146]:
#to describe the data
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.186658   0.066627  -0.333050   0.211641
std     0.853618   1.039102   0.956649   1.106251
min    -1.226685  -1.397164  -1.716557  -1.237379
25%    -1.035710  -0.415595  -0.833721  -0.604280
50%     0.012106  -0.124656  -0.435412   0.099621
75%     0.370381   0.467089   0.371131   0.987281
max     1.230046   2.208615   1.046769   1.828267

In [147]:
#dataframe sorted by index
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2022-05-31 -0.286218  0.103586  0.610048 -0.928881
2022-06-01 -0.154345 -1.716557  1.135329  0.405099
2022-06-02  1.732161 -0.838454  2.208615  0.540140
2022-06-03 -0.710300 -0.564701 -0.225030 -1.105422
2022-06-04  0.589248 -1.583139  0.038210 -0.241947
2022-06-05  0.353587  0.460312 -1.397164  0.266158
2022-06-06  1.119959 -0.819522 -0.183181  1.230046
2022-06-07 -1.237379  0.887330 -0.975312 -1.226685
2022-06-08 -1.118565  1.046769 -0.066131 -1.071320
2022-06-09  1.828267 -0.306122 -0.479117  0.266229

In [148]:
#dataframe sorted by values
#it sort the dataframe depending on "c"
df.sort_values(by="C")

                   A         B         C         D
2022-06-01  0.405099  1.135329 -1.716557 -0.154345
2022-06-04 -0.241947  0.038210 -1.583139  0.589248
2022-06-02  0.540140  2.208615 -0.838454  1.732161
2022-06-06  1.230046 -0.183181 -0.819522  1.119959
2022-06-03 -1.105422 -0.225030 -0.564701 -0.710300
2022-06-09  0.266229 -0.479117 -0.306122  1.828267
2022-05-31 -0.928881  0.610048  0.103586 -0.286218
2022-06-05  0.266158 -1.397164  0.460312  0.353587
2022-06-07 -1.226685 -0.975312  0.887330 -1.237379
2022-06-08 -1.071320 -0.066131  1.046769 -1.118565

In [149]:
#to access only the single column
df["C"]

2022-05-31    0.103586
2022-06-01   -1.716557
2022-06-02   -0.838454
2022-06-03   -0.564701
2022-06-04   -1.583139
2022-06-05    0.460312
2022-06-06   -0.819522
2022-06-07    0.887330
2022-06-08    1.046769
2022-06-09   -0.306122
Freq: D, Name: C, dtype: float64

In [150]:
#to slice the rows
#it will give the 0'th row to 3rd row
df[0:3]

                   A         B         C         D
2022-05-31 -0.928881  0.610048  0.103586 -0.286218
2022-06-01  0.405099  1.135329 -1.716557 -0.154345
2022-06-02  0.540140  2.208615 -0.838454  1.732161

In [151]:
#to select the data by using the labels
#inside the loc method,we can pass the values by labels
df.loc[d[0]]

A   -0.928881
B    0.610048
C    0.103586
D   -0.286218
Name: 2022-05-31 00:00:00, dtype: float64

In [152]:
#to selecting data on a multi axis by label
df.loc[:,["A","C"]]

                   A         C
2022-05-31 -0.928881  0.103586
2022-06-01  0.405099 -1.716557
2022-06-02  0.540140 -0.838454
2022-06-03 -1.105422 -0.564701
2022-06-04 -0.241947 -1.583139
2022-06-05  0.266158  0.460312
2022-06-06  1.230046 -0.819522
2022-06-07 -1.226685  0.887330
2022-06-08 -1.071320  1.046769
2022-06-09  0.266229 -0.306122

In [153]:
#to get the data with in some range
df.loc["20220531":"20220604",["D","C"]]

                   D         C
2022-05-31 -0.286218  0.103586
2022-06-01 -0.154345 -1.716557
2022-06-02  1.732161 -0.838454
2022-06-03 -0.710300 -0.564701
2022-06-04  0.589248 -1.583139

In [154]:
#to get single element from the dataframe
df.loc["20220531",["D","C"]]

D   -0.286218
C    0.103586
Name: 2022-05-31 00:00:00, dtype: float64

In [155]:
#to get single element from the dataframe
df.loc[d[0],["D","C"]]

D   -0.286218
C    0.103586
Name: 2022-05-31 00:00:00, dtype: float64

In [156]:
#to get exact value in 0'th index at column "C"
df.at[d[0],"C"]

0.10358615721200254

In [157]:
#selecting a value from using the position inside the dataframe
#it will select all the value from the third position
import pandas as pd
import numpy as np
d=pd.date_range("20220531",periods=10)
df=pd.DataFrame(np.random.randn(10,4),index=d,columns=["A","B","C","D"])
df.iloc[3]

A    0.361510
B   -1.031936
C    0.372669
D    1.054596
Name: 2022-06-03 00:00:00, dtype: float64

In [158]:
#to select the values in third and fourth position
df.iloc[3:5]

                   A         B         C         D
2022-06-03  0.361510 -1.031936  0.372669  1.054596
2022-06-04 -0.692438  2.036730  0.416988 -0.780231

In [159]:
#to select the value which is in 3rd to 4rth row, and it only include the column start with 0 and end with 2
df.iloc[3:5,0:2]

                   A         B
2022-06-03  0.361510 -1.031936
2022-06-04 -0.692438  2.036730

In [160]:
#boolean indexing
#it will show the values in "A" which is greater than "0"
df[df["A"]>0]

                   A         B         C         D
2022-06-01  1.629382  2.255401 -0.472197 -0.064553
2022-06-02  1.104652  2.360129  0.090976 -0.811329
2022-06-03  0.361510 -1.031936  0.372669  1.054596
2022-06-05  1.744032 -0.573721  0.167822  0.347455
2022-06-08  0.320139  1.763010  0.720953 -1.533287

In [161]:
df[df["A"]>2]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [162]:
df[df["A"]>3]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [163]:
#handling the missing values 
df2=df.reindex(index=d[0:4],columns=list(df.columns)+["E"])
df2.loc[d[0]:d[1],"E"]=1
df2

                   A         B         C         D    E
2022-05-31 -1.029249  0.104053 -1.294157  0.219284  1.0
2022-06-01  1.629382  2.255401 -0.472197 -0.064553  1.0
2022-06-02  1.104652  2.360129  0.090976 -0.811329  NaN
2022-06-03  0.361510 -1.031936  0.372669  1.054596  NaN

In [164]:
#to check the null values 
df2.isnull()

                A      B      C      D      E
2022-05-31  False  False  False  False  False
2022-06-01  False  False  False  False  False
2022-06-02  False  False  False  False   True
2022-06-03  False  False  False  False   True

In [165]:
#to drop the column 
#it will drop the null values presented in a dataframe
df2.dropna()

                   A         B         C         D    E
2022-05-31 -1.029249  0.104053 -1.294157  0.219284  1.0
2022-06-01  1.629382  2.255401 -0.472197 -0.064553  1.0

In [166]:
#fill the missing data
#to find the mean
df.mean()

A    0.013135
B    0.221338
C   -0.240865
D   -0.175060
dtype: float64

In [167]:
s=pd.Series([1,2,3,np.nan,4,5,6,7,8,9],index=d).shift(2)
s

2022-05-31    NaN
2022-06-01    NaN
2022-06-02    1.0
2022-06-03    2.0
2022-06-04    3.0
2022-06-05    NaN
2022-06-06    4.0
2022-06-07    5.0
2022-06-08    6.0
2022-06-09    7.0
Freq: D, dtype: float64

In [168]:
#it subtract all elemens of df by 5
df.sub(s,axis="index")

                   A         B         C         D
2022-05-31       NaN       NaN       NaN       NaN
2022-06-01       NaN       NaN       NaN       NaN
2022-06-02  0.104652  1.360129 -0.909024 -1.811329
2022-06-03 -1.638490 -3.031936 -1.627331 -0.945404
2022-06-04 -3.692438 -0.963270 -2.583012 -3.780231
2022-06-05       NaN       NaN       NaN       NaN
2022-06-06 -4.788722 -4.398743 -5.033770 -5.161252
2022-06-07 -6.330796 -8.613842 -4.385289 -3.690999
2022-06-08 -5.679861 -4.236990 -5.279047 -7.533287
2022-06-09 -8.187157 -7.687702 -8.992647 -7.330287

In [169]:
df

                   A         B         C         D
2022-05-31 -1.029249  0.104053 -1.294157  0.219284
2022-06-01  1.629382  2.255401 -0.472197 -0.064553
2022-06-02  1.104652  2.360129  0.090976 -0.811329
2022-06-03  0.361510 -1.031936  0.372669  1.054596
2022-06-04 -0.692438  2.036730  0.416988 -0.780231
2022-06-05  1.744032 -0.573721  0.167822  0.347455
2022-06-06 -0.788722 -0.398743 -1.033770 -1.161252
2022-06-07 -1.330796 -3.613842  0.614711  1.309001
2022-06-08  0.320139  1.763010  0.720953 -1.533287
2022-06-09 -1.187157 -0.687702 -1.992647 -0.330287

In [170]:
#to apply some functions 
#cumsum is used to find the cumulative sum value over any axis 
df.apply(np.cumsum)

                   A         B         C         D
2022-05-31 -1.029249  0.104053 -1.294157  0.219284
2022-06-01  0.600134  2.359454 -1.766354  0.154731
2022-06-02  1.704785  4.719583 -1.675379 -0.656598
2022-06-03  2.066295  3.687648 -1.302709  0.397998
2022-06-04  1.373857  5.724378 -0.885722 -0.382233
2022-06-05  3.117890  5.150657 -0.717900 -0.034778
2022-06-06  2.329167  4.751914 -1.751670 -1.196030
2022-06-07  0.998372  1.138072 -1.136959  0.112971
2022-06-08  1.318511  2.901082 -0.416007 -1.420316
2022-06-09  0.131354  2.213380 -2.408654 -1.750603

In [171]:
#lambda function will take any number of arguements but can only have one expression 
#it give the subtraction of x.max and x.min
df.apply(lambda x:x.max()-x.min())

A    3.074828
B    5.973971
C    2.713600
D    2.842287
dtype: float64

In [172]:
#histograms ---histogram is a representation of distribution of data
#the value_counts() function returns a series that contain counts of unique values 
s.value_counts()

1.0    1
2.0    1
3.0    1
4.0    1
5.0    1
6.0    1
7.0    1
dtype: int64

In [173]:
s=pd.Series(["pandas","python","jupyter",np.nan,"java","colab"])
#string method inside pandas
s.str.upper()

0     PANDAS
1     PYTHON
2    JUPYTER
3        NaN
4       JAVA
5      COLAB
dtype: object

In [174]:
df=pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.462339  2.081238  1.634096 -1.247056
1  0.640725 -0.727094 -0.444563 -0.233426
2  0.369702 -1.406251 -0.607975  1.903503
3  0.687290  1.455342 -0.436371 -0.197273
4 -0.856395 -0.930794  2.468372 -1.430263
5 -0.512619  1.700828 -1.346040  0.741853
6 -0.792389 -0.817817  0.363192  0.532518
7 -0.145695  0.912552 -0.563899 -0.421989
8  0.915340  1.344560  2.744296  0.231355
9 -0.572751 -0.101819  0.347044 -1.162580

In [175]:
#break the dataframe
df2=[df[:3],df[3:7],df[7:]]
df2

[          0         1         2         3
 0 -0.462339  2.081238  1.634096 -1.247056
 1  0.640725 -0.727094 -0.444563 -0.233426
 2  0.369702 -1.406251 -0.607975  1.903503,
           0         1         2         3
 3  0.687290  1.455342 -0.436371 -0.197273
 4 -0.856395 -0.930794  2.468372 -1.430263
 5 -0.512619  1.700828 -1.346040  0.741853
 6 -0.792389 -0.817817  0.363192  0.532518,
           0         1         2         3
 7 -0.145695  0.912552 -0.563899 -0.421989
 8  0.915340  1.344560  2.744296  0.231355
 9 -0.572751 -0.101819  0.347044 -1.162580]

In [176]:
#concat several pieces
pd.concat(df2)

          0         1         2         3
0 -0.462339  2.081238  1.634096 -1.247056
1  0.640725 -0.727094 -0.444563 -0.233426
2  0.369702 -1.406251 -0.607975  1.903503
3  0.687290  1.455342 -0.436371 -0.197273
4 -0.856395 -0.930794  2.468372 -1.430263
5 -0.512619  1.700828 -1.346040  0.741853
6 -0.792389 -0.817817  0.363192  0.532518
7 -0.145695  0.912552 -0.563899 -0.421989
8  0.915340  1.344560  2.744296  0.231355
9 -0.572751 -0.101819  0.347044 -1.162580

In [177]:
left=pd.DataFrame({"A":[1,2],"B":[3,4]})
left

   A  B
0  1  3
1  2  4

In [178]:
right=pd.DataFrame({"A":[3,2],"D":[4,5]})
right

   A  D
0  3  4
1  2  5

In [179]:
pd.merge(left,right,on="A")

   A  B  D
0  2  4  5

In [180]:
df

          0         1         2         3
0 -0.462339  2.081238  1.634096 -1.247056
1  0.640725 -0.727094 -0.444563 -0.233426
2  0.369702 -1.406251 -0.607975  1.903503
3  0.687290  1.455342 -0.436371 -0.197273
4 -0.856395 -0.930794  2.468372 -1.430263
5 -0.512619  1.700828 -1.346040  0.741853
6 -0.792389 -0.817817  0.363192  0.532518
7 -0.145695  0.912552 -0.563899 -0.421989
8  0.915340  1.344560  2.744296  0.231355
9 -0.572751 -0.101819  0.347044 -1.162580

In [181]:
#groping
df.groupby([2,3]).sum()

                            0         1
2         3
-1.346040  0.741853 -0.512619  1.700828
-0.607975  1.903503  0.369702 -1.406251
-0.563899 -0.421989 -0.145695  0.912552
-0.444563 -0.233426  0.640725 -0.727094
-0.436371 -0.197273  0.687290  1.455342
 0.347044 -1.162580 -0.572751 -0.101819
 0.363192  0.532518 -0.792389 -0.817817
 1.634096 -1.247056 -0.462339  2.081238
 2.468372 -1.430263 -0.856395 -0.930794
 2.744296  0.231355  0.915340  1.344560

In [182]:
#reshape the dataframework
my_tuple=list(zip(*[[1,2,3,4,5,17,18,19],[11,12,13,6,7,8,9,10]]))
print(type(my_tuple))
index=pd.MultiIndex.from_tuples(my_tuple,names=["First","Second"])
print(index)
df=pd.DataFrame(np.random.randn(8,2),index=index,columns=["A","B"])
df2=df[:2]
df2

<class 'list'>
MultiIndex([( 1, 11),
            ( 2, 12),
            ( 3, 13),
            ( 4,  6),
            ( 5,  7),
            (17,  8),
            (18,  9),
            (19, 10)],
           names=['First', 'Second'])

                     A         B
First Second
1     11     -0.412120 -1.563864
2     12      1.041973  1.548474

In [183]:
df2.stack()

First  Second
1      11      A   -0.412120
               B   -1.563864
2      12      A    1.041973
               B    1.548474
dtype: float64

In [184]:
df2.unstack()

              A                   B
Second       11        12        11        12
First
1      -0.41212       NaN -1.563864       NaN
2           NaN  1.041973       NaN  1.548474

In [185]:
df=pd.DataFrame({"A":["a","b","c","d"]*3,
                 "B":["A","B","C"]*4,
                 "C":["P","P","P","Q","Q","Q"]*2,
                  "D":np.random.randn(12),
                  "E":np.random.randn(12)})
df

    A  B  C         D         E
0   a  A  P  1.448550  0.799399
1   b  B  P  0.744642  1.787775
2   c  C  P  0.354959 -0.444228
3   d  A  Q -0.585844  0.159051
4   a  B  Q  1.022924  1.696417
5   b  C  Q -0.838247  0.878994
6   c  A  P -0.657705  0.240303
7   d  B  P  0.675959 -1.645572
8   a  C  P -0.851792 -0.127962
9   b  A  Q -0.159438  0.568776
10  c  B  Q  0.359912  1.151263
11  d  C  Q -0.154998 -0.346290

In [186]:
pd.pivot_table(df,values="D",index=["A","B"],columns=["C"])

C           P         Q
A B
a A  1.448550       NaN
  B       NaN  1.022924
  C -0.851792       NaN
b A       NaN -0.159438
  B  0.744642       NaN
  C       NaN -0.838247
c A -0.657705       NaN
  B       NaN  0.359912
  C  0.354959       NaN
d A       NaN -0.585844
  B  0.675959       NaN
  C       NaN -0.154998

In [187]:
dates=pd.date_range("31/05/2022 00:00",periods=5,freq="s")
dates

DatetimeIndex(['2022-05-31 00:00:00', '2022-05-31 00:00:01',
               '2022-05-31 00:00:02', '2022-05-31 00:00:03',
               '2022-05-31 00:00:04'],
              dtype='datetime64[ns]', freq='S')

In [188]:
ts=pd.Series(np.random.randint(len(dates)),dates)
ts

2022-05-31 00:00:00    4
2022-05-31 00:00:01    4
2022-05-31 00:00:02    4
2022-05-31 00:00:03    4
2022-05-31 00:00:04    4
Freq: S, dtype: int64

In [189]:
ts_utc=ts.tz_localize("UTC")
ts_utc

2022-05-31 00:00:00+00:00    4
2022-05-31 00:00:01+00:00    4
2022-05-31 00:00:02+00:00    4
2022-05-31 00:00:03+00:00    4
2022-05-31 00:00:04+00:00    4
Freq: S, dtype: int64

In [190]:
ts_utc.tz_convert("Us/Eastern")

2022-05-30 20:00:00-04:00    4
2022-05-30 20:00:01-04:00    4
2022-05-30 20:00:02-04:00    4
2022-05-30 20:00:03-04:00    4
2022-05-30 20:00:04-04:00    4
Freq: S, dtype: int64

In [199]:
dates=pd.date_range("31/05/2022 00:00",periods=5,freq="M")
dates

DatetimeIndex(['2022-05-31', '2022-06-30', '2022-07-31', '2022-08-31',
               '2022-09-30'],
              dtype='datetime64[ns]', freq='M')

In [192]:
ts=pd.Series(np.random.randint(len(dates)),dates)
ts

2022-05-31    1
2022-06-30    1
2022-07-31    1
2022-08-31    1
2022-09-30    1
Freq: M, dtype: int64

In [193]:
ps=ts.to_period()
ps

2022-05    1
2022-06    1
2022-07    1
2022-08    1
2022-09    1
Freq: M, dtype: int64

In [194]:
ps.to_timestamp()

2022-05-01    1
2022-06-01    1
2022-07-01    1
2022-08-01    1
2022-09-01    1
Freq: MS, dtype: int64

In [195]:
df=pd.DataFrame({"id":[1,2,3,4,5,6],
                "grade":["a","b","c","b","a","e"]})
df

   id grade
0   1     a
1   2     b
2   3     c
3   4     b
4   5     a
5   6     e

In [196]:
df["Grade"]=df["grade"].astype("category")
df["Grade"]

0    a
1    b
2    c
3    b
4    a
5    e
Name: Grade, dtype: category
Categories (4, object): ['a', 'b', 'c', 'e']

In [197]:
df["Grade"].cat.categories=["good","very bad","very good","excellent"]

In [198]:
df["Grade"]=df["Grade"].cat.set_categories(["very good","bad","very bad","good","medium"])
df["Grade"]

0         good
1     very bad
2    very good
3     very bad
4         good
5          NaN
Name: Grade, dtype: category
Categories (5, object): ['very good', 'bad', 'very bad', 'good', 'medium']